---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFileReadOptions.#ctor
source: html/f0423233-9539-7982-c2ff-d7a4a319f330.htm
---
# Autodesk.Revit.DB.IFC.IFCFileReadOptions.#ctor Method

Creates a default IFCFileReadOptions.

## Syntax (C#)
```csharp
public IFCFileReadOptions()
```